[{"title": "Nigerian lawmakers want textbook ‘Queen Primer’ banned for pro-LGBTQ+ contents", "description": "Nigerian lawmakers in the House of Representatives want the federal government and other sub-national governments to ban the use of the popular children's textbook ‘Queen Premier’ in schools for containing pro-LGBTQ+ texts. The lawmakers made the call on Thursday during plenary, following the adoption of a motion moved by Sulaiman Gumi, who wants the Nigerian […] The post Nigerian lawmakers want textbook ‘Queen Primer’ banned for pro-LGBTQ+ contents appeared first on The Guardian Nigeria News - Nigeria and World News.", "publishedAt": "2023-10-20 09:26:09", "url": "https://guardian.ng/news/nigerian-lawmakers-want-textbook-queen-primer-banned-for-pro-lgbtq-contents/", "imageUrl": null, "author": ["Dennis Erezi"]}, {"title": "China says nuclear weapons only intended for 'self-defence'", "description": "Washington said this week that China's nuclear arsenal was developing much faster than US projections had previously anticipated, and Beijing is likely to have more than 1,000 operational nuclear warheads by 2030.", "publishedAt": "2023-10-20 09:14:37", "url": "https://economictimes.indiatimes.com/news/defence/china-says-nuclear-weapons-only-intended-for-self-defence/articleshow/104580045.cms", "imageUrl": null, "author": null}, {"title": "Brynamman mum honoured at Pride of Britain for Joseph's Smile", "description": "AN Amman Valley woman’s hard work and dedication to helping others was rewarded with a Pride of Britain nomination.", "publishedAt": "2023-10-20 09:14:29", "url": "https://www.southwalesguardian.co.uk/news/23868094.brynamman-mum-honoured-pride-britain-josephs-smile/?ref=rss", "imageUrl": "https://www.southwalesguardian.co.uk/resources/images/17352877/?type=app&htype=0", "author": null}, {"title": "Credit growth to ensure sustained phase of GDP growth: SBI Research", "description": "SBI economists predict that the credit to GDP ratio in India will rise to 1.7 in FY24, indicating sustained GDP growth. The narrowing credit-to-GDP gap reflects increased credit demand and higher capacity utilization in the manufacturing sector. Credit growth in scheduled commercial banks has been outpacing aggregate deposits since early 2022.", "publishedAt": "2023-10-20 09:13:14", "url": "https://economictimes.indiatimes.com/news/economy/policy/credit-growth-to-ensure-sustained-phase-of-gdp-growth-sbi-research/articleshow/104579897.cms", "imageUrl": null, "author": null}, {"title": "H|T: The Healthtech Times – AI takeover: predictive pitfall or “medicine’s biggest moment” since antibiotics?", "description": "Plus: Quebec City-based OpSens acquired by US firm in $345M deal. The post H|T: The Healthtech Times – AI takeover: predictive pitfall or “medicine’s biggest moment” since antibiotics? first appeared on BetaKit.", "publishedAt": "2023-10-20 09:00:47", "url": "https://betakit.com/ht-the-healthtech-times-ai-takeover-predictive-pitfall-or-medicines-biggest-moment-since-antibiotics/", "imageUrl": null, "author": ["Alex Riehl"]}, {"title": "Hydrogen-fueled Vessel Wins AiP Towards Demonstration Operation", "description": "Mitsui O.S.K Lines, Ltd. (MOL), MOL Drybulk, Ltd., Onomichi Dockyard Co., Ltd., Kawasaki Heavy Industries, Ltd. (Kawasaki) and Japan Engine Corporation (J-ENG) conducted a risk assessment of a Multi-Purpose Vessel powered by hydrogen, zero- emission fuel and has been granted Approval in Principle (AiP) of parcel layout concept from Nippon Kaiji Kyokai (ClassNK). This is ...", "publishedAt": "2023-10-20 09:00:26", "url": "https://www.hellenicshippingnews.com/hydrogen-fueled-vessel-wins-aip-towards-demonstration-operation/", "imageUrl": null, "author": ["hellenicshippingnews..."]}]